app/controllers/api/v1/batches_controller.rb

        def set_batch
            begin
                @batch = Batch.find(params[:id])
---
SELECT  "batches".* FROM "batches" WHERE "batches"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]