app/controllers/api/v1/batches_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND (reference = 'BR102030' AND purchase_channel = 'Site BR3')  [["user_id", 2]]
SELECT  1 AS one FROM "orders" WHERE "orders"."user_id" = $1 AND (reference = 'BR102030' AND purchase_channel = 'Site BR3' AND status = 'ready') LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."batch_id" = $1  [["batch_id", 13]]
INSERT INTO "batches" ("reference", "purchase_channel", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["reference", "BR102030"], ["purchase_channel", "Site BR3"], ["user_id", 2], ["created_at", "2019-04-26 23:00:29.958954"], ["updated_at", "2019-04-26 23:00:29.958954"]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND (reference = 'BR102030' AND purchase_channel = 'Site BR3' AND status = 'ready')  [["user_id", 2]]
---
    def create
        @orders = current_user.orders.where("reference = ? AND purchase_channel = ? AND status = ?", params[:reference], params[:purchase_channel], 'ready')

        if @orders.empty?
            render json: {status: :fail, data: {}}, status: :unprocessable_entity
        else
            @batch = Batch.new(batch_params.merge(user: current_user))
            if @batch.save
                @orders.each do |order|

SELECT "orders".* FROM "orders" WHERE "orders"."batch_id" = $1  [["batch_id", 14]]
SELECT  1 AS one FROM "orders" WHERE "orders"."batch_id" = $1 AND (status = 'production') LIMIT $2  [["batch_id", 17], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."batch_id" = $1 AND (status = 'production')  [["batch_id", 17]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", "closing"], ["updated_at", "2019-04-26 23:40:27.523815"], ["id", 2]]
---
    def produce
        @orders = @batch.orders.where('status = ?', 'production')

        if @orders.empty?
            render json: {status: :fail, data: {}}, status: :unprocessable_entity
        else
            @orders.each do |order|
                order.update(status: 'closing')

SELECT "orders".* FROM "orders" WHERE "orders"."batch_id" = $1 AND (status = 'closing' AND delivery_service = 'SEDEX')  [["batch_id", 7]]
SELECT  1 AS one FROM "orders" WHERE "orders"."batch_id" = $1 AND (status = 'closing' AND delivery_service = NULL) LIMIT $2  [["batch_id", 5], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."batch_id" = $1 AND (status = 'closing' AND delivery_service = 'SEDEX')  [["batch_id", 5]]
UPDATE "orders" SET "status" = $1, "updated_at" = $2 WHERE "orders"."id" = $3  [["status", "closing"], ["updated_at", "2019-04-27 02:49:11.058730"], ["id", 1]]
---
    def submit
        @orders = @batch.orders.where('status = ? AND delivery_service = ?', 'closing', params[:delivery_service])

        if @orders.empty?
            render json: {status: :fail, data: {}}, status: :unprocessable_entity
        else
            @orders.each do |order|
                order.update(status: 'sent')

SELECT  "batches".* FROM "batches" WHERE "batches"."id" = $1 LIMIT $2  [["id", 17], ["LIMIT", 1]]
---
        def set_batch
            begin
                @batch = Batch.find(if params[:id] != nil then params[:id] else params[:batch_id] end)