app/controllers/api/v1/orders_controller.rb

    def index
        if params[:purchase_channel] != nil
            @orders = current_user.orders.where("purchase_channel = ?", params[:purchase_channel])
            render json: {status: :success, data: @orders}
        else
            @orders = current_user.orders
---
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]

    def create
        @order = Order.new(order_params.merge(user: current_user))

        if @order.save
---
INSERT INTO "orders" ("reference", "purchase_channel", "client_name", "address", "delivery_service", "total_value", "line_items", "status", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"

        def set_order
            begin
                @order = Order.find(params[:id])
---
SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]