app/controllers/api/v1/report_controller.rb

SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND (purchase_channel = 'Site BR')  [["user_id", 2]]
---
    def index
        if params[:purchase_channel] != nil
            @orders = current_user.orders.where("purchase_channel = ?", params[:purchase_channel])
        else
            @orders = current_user.orders
        end

        total_orders = 0
        total_value = 0
        @orders.each do |order|