app/controllers/api/v1/search_controller.rb

    def search
        if params[:reference] != nil
            @orders = current_user.orders.where("reference = ?", params[:reference])
            render json: {status: :success, data: {orders: @orders}}
        elsif params[:client_name] != nil
            @orders = current_user.orders.where("client_name = ?", params[:client_name])
            render json: {status: :success, data: {orders: @orders}}
        else
            @orders = current_user.orders
---
SELECT  "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND "orders"."id" = $2 LIMIT $3  [["user_id", 2], ["id", nil], ["LIMIT", 1]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1 AND (client_name = 'São Benedito')  [["user_id", 2]]
SELECT "orders".* FROM "orders" WHERE "orders"."user_id" = $1  [["user_id", 2]]