app/controllers/api/v1/user_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "mauro@ca.com"], ["LIMIT", 1]]
INSERT INTO "users" ("email", "encrypted_password", "created_at", "updated_at", "name", "authentication_token") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
    def signup
        if not params[:email] != nil
            render json: {status: :fail, data: {email: 'Please enter an email'}}, status: :bad_request
        elsif not params[:password] != nil
            render json: {status: :fail, data: {password: 'Please enter a password'}}, status: :bad_request
        else
            begin
                User.find_by! email: params[:email]
                render json: {status: :fail, data: {email: 'E-mail already registered'}}, status: :unprocessable_entity
            rescue ActiveRecord::RecordNotFound
                @user = User.create(user_params)